#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередУдалением(Отказ)
	
	Если Не Отказ Тогда
		Справочники.Gists.УдалитьGist(Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Идентификатор = "";
	Адрес = "";
	ДатаСоздания = Неопределено;
	ДатаИзменения = Неопределено;
	Усечение = Ложь;
	Для Каждого Элемент Из Файлы Цикл
		Элемент.Адрес = "";
		Элемент.Размер = 0;
		Элемент.Усечение = Ложь;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли