#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Пользователь", ТекущийПользователь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Теги, "Пользователь", ТекущийПользователь);
	
	Элементы.ФормаПолучитьССайта.Видимость = Не ПустаяСтрока(ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		Пользователи.ТекущийПользователь(), "ТокенGitHub"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АвторизацияGitHub(Команда)
	ОткрытьФорму("Справочник.Gists.Форма.АвторизацияGitHub");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьССайта(Команда)
	
	ПолучитьССайтаНаСервере();
	
	Элементы.Список.Обновить();
	Элементы.Теги.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПолучитьССайтаНаСервере()
	Справочники.Gists.ПрочитатьGists();
КонецПроцедуры

#КонецОбласти