#Область СлужебныйПрограммныйИнтерфейс

// Преобразует (сериализует) любое значение в JSOM-строку.
// См. также ЗначениеИзСтрокиJSOM.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо сериализовать в JSOM-строку.
//
// Возвращаемое значение:
//  Строка - JSOM-строка.
//
Функция ЗначениеВСтрокуJSOM(Значение) Экспорт
	
	ЗаписьJSOM = Новый ЗаписьJSON();
	ЗаписьJSOM.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSOM, Значение);
		
	Возврат СтрЗаменить(СтрЗаменить(ЗаписьJSOM.Закрыть(), Символы.ВК, ""), Символы.ПС, "");
	
КонецФункции

// Выполняет преобразование (десериализацию) JSOM-строки в значение.
// См. также ЗначениеВСтрокуJSOM.
//
// Параметры:
//  СтрокаJSOM - Строка - JSOM-строка.
//	ПрочитатьВСоответствие - Булево - Если установлено Истина, чтение объекта JSON будет выполнено в Соответствие.
// Возвращаемое значение:
//  Произвольный - значение, полученное из переданной JSOM-строки.
//
Функция ЗначениеИзСтрокиJSOM(СтрокаJSOM, ПрочитатьВСоответствие = Ложь, ИменаСвойствСоЗначениямиДата = "") Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSOM);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	
КонецФункции

#КонецОбласти