#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Элементы.Открытый.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Автор = Пользователи.ТекущийПользователь();
		
		Объект.Файлы.Добавить();
		
	КонецЕсли;
	
	Для Каждого Элемент Из Объект.Файлы Цикл
		ДобавитьФайлНаФорму(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	&ОписаниеБезТегов КАК Наименование
					   |
					   |ОБЪЕДИНИТЬ ВСЕ
					   |
					   |ВЫБРАТЬ
					   |	""#"" + Теги.Наименование
					   |ИЗ
					   |	Справочник.Теги КАК Теги
					   |ГДЕ
					   |	Теги.Ссылка В(&Ссылка)";
		Запрос.УстановитьПараметр("ОписаниеБезТегов", СокрЛП(ТекущийОбъект.ОписаниеБезТегов));
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Теги.ВыгрузитьКолонку(0));
		ТекущийОбъект.Описание = СтрСоединить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0), " ");
		
		Реквизиты = Метаданные.Справочники.Gists.ТабличныеЧасти.Файлы.Реквизиты;
		Для Каждого Строка Из ТекущийОбъект.Файлы Цикл
			
			Ключ = "Файл" + Формат(Строка.НомерСтроки, "ЧГ=");
			Для Каждого Реквизит Из Реквизиты Цикл
				Строка[Реквизит.Имя] = ЭтаФорма[Ключ + Реквизит.Имя];						
			КонецЦикла;
						
		КонецЦикла;

		Справочники.Gists.ЗаписатьGist(ТекущийОбъект.Идентификатор, ТекущийОбъект);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизитыКопия = ОбщегоНазначения.СкопироватьРекурсивно(ПроверяемыеРеквизиты);
	ПроверяемыеРеквизиты.Очистить();
	Для Каждого Элемент Из ПроверяемыеРеквизитыКопия Цикл 
		Если Не СтрНачинаетсяС(Элемент, "Файл") Тогда 
			ПроверяемыеРеквизиты.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
		
	Для Номер = 1 По Объект.Файлы.Количество() Цикл
		Ключ = "Файл" + Формат(Номер, "ЧГ=");
		ПроверяемыеРеквизиты.Добавить(Ключ + "Имя");
		ПроверяемыеРеквизиты.Добавить(Ключ + "Тело");	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура АдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.Адрес);
	
КонецПроцедуры

#Область Подключаемый_Файл

&НаКлиенте
Процедура Подключаемый_ФайлИмяПриИзменении(Элемент)
	
	Элемент.Родитель.Родитель.ЗаголовокСвернутогоОтображения = ЭтаФорма[Элемент.Имя];

	Имя = Новый Массив;
	Для Номер = 1 По Объект.Файлы.Количество() Цикл 
		Имя.Добавить(ЭтаФорма[СтрШаблон("Файл%1Имя", Номер)]);
	КонецЦикла;
	
	Объект.Наименование = СтрСоединить(Имя, ", ");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ФайлАдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПустаяСтрока(ЭтаФорма[Элемент.Имя]) Тогда
		ЗапуститьПриложение(ЭтаФорма[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	ДобавитьФайлНаФорму(Объект.Файлы.Добавить().ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	УдалитьФайлСФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьФайлНаФорму(Знач Строка)

	Если ТипЗнч(Строка) = Тип("Число") Тогда 
		Строка = Объект.Файлы.НайтиПоИдентификатору(Строка);
	КонецЕсли;
	
	Ключ = "Файл" + Формат(Строка.НомерСтроки, "ЧГ=");
	
	Реквизиты = Метаданные.Справочники.Gists.ТабличныеЧасти.Файлы.Реквизиты;
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Элемент Из Реквизиты Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Ключ + Элемент.Имя, Элемент.Тип,, Элемент.Синоним, Истина));
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Для Каждого Элемент Из Реквизиты Цикл 
		ЭтаФорма[Ключ + Элемент.Имя] = Строка[Элемент.Имя];
	КонецЦикла;
	
	Корень = Элементы.Вставить("Группа" + Ключ, Тип("ГруппаФормы"), Элементы.ГруппаФайлы,
		Элементы.ГруппаФайлыКоманднаяПанель);
	Корень.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Корень.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Корень.Заголовок = " ";
	Корень.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	Корень.ЗаголовокСвернутогоОтображения = Строка.Имя;
	Корень.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	Корень.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	
	Шапка = Элементы.Добавить(Корень.Имя + "Шапка", Тип("ГруппаФормы"), Корень);
	Шапка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Шапка.ОтображатьЗаголовок = Ложь;
	Элемент = Элементы.Добавить(Ключ + "Имя", Тип("ПолеФормы"), Шапка);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "Имя";
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ФайлИмяПриИзменении");
	Элемент = Элементы.Добавить(Ключ + "Адрес", Тип("ПолеФормы"), Шапка);
	Элемент.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент.Гиперссылка = Истина;
	Элемент.ПутьКДанным = Ключ + "Адрес";
	Элемент.УстановитьДействие("Нажатие", "Подключаемый_ФайлАдресНажатие");
	
	Элемент = Элементы.Добавить(Ключ + "Тело", Тип("ПолеФормы"), Корень);
	Элемент.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
	Элемент.ПутьКДанным = Ключ + "Тело";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	Свойства = Элементы.Добавить(Корень.Имя + "Свойства", Тип("ГруппаФормы"), Корень);
	Свойства.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Свойства.Заголовок = "Свойства";
	Свойства.ШрифтЗаголовка = Новый Шрифт(,,,,,,, 8);
	Свойства.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	Свойства.Скрыть();
	Свойства.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	Элемент = Элементы.Добавить(Ключ + "Тип", Тип("ПолеФормы"), Свойства);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "Тип";
	Элемент = Элементы.Добавить(Ключ + "Язык", Тип("ПолеФормы"), Свойства);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "Язык";
	Элемент = Элементы.Добавить(Ключ + "Размер", Тип("ПолеФормы"), Свойства);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "Размер";
	Элемент.ТолькоПросмотр = Истина;
	Элемент = Элементы.Добавить(Ключ + "Усечение", Тип("ПолеФормы"), Свойства);
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.ПутьКДанным = Ключ + "Усечение";
	Элемент.ТолькоПросмотр = Истина;
		
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлСФормы()
	
	Корень = ПолучитьКорень(ЭтаФорма.ТекущийЭлемент);
	Если Корень = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Ключ = Сред(Корень.Имя, 7);
	
	Элементы.Удалить(Корень);
	
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого Элемент Из Метаданные.Справочники.Gists.ТабличныеЧасти.Файлы.Реквизиты Цикл
		УдаляемыеРеквизиты.Добавить(Ключ + Элемент.Имя);
	КонецЦикла;
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
	Объект.Файлы.Удалить(Число(Сред(Ключ, 5)) - 1);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКорень(Элемент)
	
	Если Элемент = Неопределено Тогда 
		Возврат Неопределено;
		
	ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаФормы") И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрЗаменить(Элемент.Имя, "ГруппаФайл", "")) Тогда 
		Возврат Элемент;
		
	Иначе 
		Возврат ПолучитьКорень(Элемент.Родитель);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти