#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Элементы.Открытый.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	&ОписаниеБезТегов КАК Наименование
					   |
					   |ОБЪЕДИНИТЬ ВСЕ
					   |
					   |ВЫБРАТЬ
					   |	""#"" + Теги.Наименование
					   |ИЗ
					   |	Справочник.Теги КАК Теги
					   |ГДЕ
					   |	Теги.Ссылка В(&Ссылка)";
		Запрос.УстановитьПараметр("ОписаниеБезТегов", СокрЛП(ТекущийОбъект.ОписаниеБезТегов));
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Теги.ВыгрузитьКолонку(0));
		ТекущийОбъект.Описание = СтрСоединить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0), " ");

		Справочники.Gists.ЗаписатьGist(ТекущийОбъект.Идентификатор, ТекущийОбъект);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.Адрес);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

&НаКлиенте
Процедура ФайлыИмяПриИзменении(Элемент)
	
	Значения = Новый Массив;
	Для Каждого Элемент Из Объект.Файлы Цикл
		Если Не ПустаяСтрока(Элемент.Имя) Тогда
			Значения.Добавить(Элемент.Имя);
		КонецЕсли;		
	КонецЦикла;
	
	Объект.Наименование = СтрСоединить(Значения, ", ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти